using System.Collections.Generic;

namespace Redage.SDK.Models
{
    public class DonatePack
    {
        /// <summary>
        /// Множетель доната
        /// </summary>
        public int[] PriceRB = new int[] 
        {
            199,
            299,
            14999,
            499,
            7999,
            8999,
            599,
            17999,
            699,
            29999,
            799
        };
        /// <summary>
        /// Цены донат пакетов
        /// </summary>
        public int[] GiveMoney = new int[]
        {
            1250000,
            2500000,
            60000,
            5000000,
            80000,
            200000,
            7500000,
            125000,
            10000000,
            450000,
            12000000
        };

        public List<string>[] List =
        {
            new List<string>()
            {
                "1.250.000$",
                "Стандартный кейс", 
                "VIP Diamond на 5 дней", 
                "10 exp (опыта)", 
                "Лицензия на мототранспорт", 
                "Лицензия на легковой транспорт", 
                "Рабочий топор", 
                "Усиленная кирка", 
                "Вейп",
            },
            new List<string>()
            {
                "2.500.000$",
                "Странный Кейс",
                "VIP Diamond на 10 дней",
                "10 exp (опыта)",
                "Лицензия на грузовой транспорт",
                "Лицензия на легковой транспорт",
                "Рация",
                "Бонг",
                "Автомобиль Seminole",
            },
            new List<string>()
            {
                "5.000.000$",
                "Особенный Кейс",
                "VIP Diamond на 15 дней",
                "15 exp (опыта)",
                "Лицензия на мототранспорт",
                "Лицензия на легковой и грузовой транспорт",
                "Медкарта",
                "Кальян",
                "Автомобиль Baller",
            },
            new List<string>()
            {
                "7.500.000$",
                "Редкий кейс",
                "30 дней Diamond VIP",
                "20 exp (опыта)",
                "Медкарта",
                "Лицензия на вертолёты",
                "Лицензия на самолёты",
                "Лицензия на оружие",
                "Профессиональная кирка",
            },
            new List<string>()
            {
                "{0}$",
                "Машина Komoda",
                "30 дней Diamond VIP",
                "35 exp (опыта)",
            },
            new List<string>()
            {
                "{0}$",
                "45 дней Diamond VIP",
                "30 exp (опыта)",
                "Лицензия на вертолёты и самолёты",
            },
            new List<string>()
            {
                "{0}$",
                "Лютый кейс",
                "30 дней Diamond VIP",
                "15 exp (опыта)",
                "Медкарта", 
                "Лицензия на вертолёты",
                "Лицензия на самолёты",
                "Автомобиль Schafter2",
            },
            new List<string>()
            {
                "{0}$",
                "Машина Pariah",
                "60 дней Diamond VIP",
                "45 exp (опыта)",
            },
            new List<string>()
            {
                "{0}$",
                "Легендарный кейс",
                "45 дней Diamond VIP",
                "30 exp (опыта)",
                "Случайный шестизначный номер телефона",
                "Лицензия на вертолёты и самолёты",
                "Сумка GUCCI",
                "Лицензия на оружие и парамедика",
                "Легендарный автомобиль - Carbonizzare",
            },
            new List<string>()
            {
                "{0}$",
                "Машина Neon",
                "120 дней Diamond VIP",
                "60 exp (опыта)",
                "Случайный пятизначный номер телефона",
            },
            new List<string>()
            {
                "{0}$",
                "90 дней Diamond VIP",
                "60 exp (опыта)",
                "Случайный пятизначный номер телефона",
                "Лицензия на вертолёты и самолёты",
                "Уникальный аксессуар - борода",
                "Автомобиль - Tesla",
                "Лицензия на оружие и мед-карта",
                "Лицензия парамедика",
            },
        };
    }
}